projects/rails/cat_site/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 2], ["start_date", "2021-07-30"], ["end_date", "2021-07-31"], ["created_at", "2021-07-29 21:57:28.833497"], ["updated_at", "2021-07-29 21:57:28.833497"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 4]]
---
  def current_cat_rental_request
    @rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])