projects/rails/cat_site/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])
    if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Evil. Absolutely pure EVIL. DO NOT RENT THIS CAT!"], ["updated_at", "2021-07-28 22:07:56.150794"], ["id", 6]]