projects/rails/URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 4], ["shortened_url_id", 3], ["created_at", "2021-06-30 22:16:12.065775"], ["updated_at", "2021-06-30 22:16:12.065775"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, shortened_url_id: shortened_url.id)