projects/rails/cat_site/app/views/cat_rental_requests/new.html.erb


    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"